Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM048.atdf
            <instance name="UART2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="UART3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02610" name="UDID" version="">
            <instance name="UDID">
               <register-group address-space="UDIDx" name="UDID" name-in-module="UDID" offset="0x1fc41840" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02813" name="USB" version="">
            <instance name="USB">
               <register-group address-space="periph1" name="USB" name-in-module="USB" offset="0x1f808440" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02674" name="WDT" version="">
            <instance name="WDT">
               <register-group address-space="periph0" name="WDT" name-in-module="WDT" offset="0x1f803990" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
      </peripherals>
      <interrupts>
         <interrupt caption="Core Timer" index="0" name="CORE_TIMER" />
         <interrupt caption="Core Software 0" index="1" name="CORE_SOFTWARE_0" />
         <interrupt caption="Core Software 1" index="2" name="CORE_SOFTWARE_1" />
         <interrupt caption="External 0" index="3" name="EXTERNAL_0" />
         <interrupt caption="External 1" index="4" name="EXTERNAL_1" />
         <interrupt caption="External 2" index="5" name="EXTERNAL_2" />
         <interrupt caption="External 3" index="6" name="EXTERNAL_3" />
         <interrupt caption="External 4" index="7" name="EXTERNAL_4" />
         <interrupt caption="PORT A Change Notification" index="8" name="CHANGE_NOTICE_A" />
         <interrupt caption="PORT B Change Notification" index="9" name="CHANGE_NOTICE_B" />
         <interrupt caption="PORT C Change Notification" index="10" name="CHANGE_NOTICE_C" />
         <interrupt caption="PORT D Change Notification" index="11" name="CHANGE_NOTICE_D" />
         <interrupt caption="Timer 1" index="17" name="TIMER_1" />
         <interrupt caption="Timer 2" index="18" name="TIMER_2" />
         <interrupt caption="Timer 3" index="19" name="TIMER_3" />
         <interrupt caption="Comparator 1" index="23" name="COMPARATOR_1" />
         <interrupt caption="Comparator 2" index="24" name="COMPARATOR_2" />
         <interrupt caption="Comparator 3" index="25" name="COMPARATOR_3" />
         <interrupt caption="USB" index="29" name="USB" />
         <interrupt caption="Real Time Clock Alarm" index="32" name="RTCC" />
         <interrupt caption="ADC Conversion Done" index="33" name="ADC" />
         <interrupt caption="HLVD" index="36" name="HLVD" />
         <interrupt caption="Logic Cell 1" index="37" name="CLC1" />
         <interrupt caption="Logic Cell 2" index="38" name="CLC2" />
         <interrupt caption="Logic Cell 3" index="39" name="CLC3" />
         <interrupt caption="Logic Cell 4" index="40" name="CLC4" />
         <interrupt caption="SPI 1 Error" index="41" name="SPI1_ERR" />
         <interrupt caption="SPI 1 Transmission" index="42" name="SPI1_TX" />
         <interrupt caption="SPI 1 Reception" index="43" name="SPI1_RX" />
         <interrupt caption="SPI 2 Error" index="44" name="SPI2_ERR" />
         <interrupt caption="SPI 2 Transmission" index="45" name="SPI2_TX" />
         <interrupt caption="SPI 2 Reception" index="46" name="SPI2_RX" />
         <interrupt caption="SPI 3 Error" index="47" name="SPI3_ERR" />
         <interrupt caption="SPI 3 Transmission" index="48" name="SPI3_TX" />
         <interrupt caption="SPI 3 Reception" index="49" name="SPI3_RX" />
         <interrupt caption="UART 1 Reception" index="53" name="UART1_RX" />
         <interrupt caption="UART 1 Transmission" index="54" name="UART1_TX" />
         <interrupt caption="UART 1 Error" index="55" name="UART1_ERR" />
         <interrupt caption="UART 2 Reception" index="56" name="UART2_RX" />
         <interrupt caption="UART 2 Transmission" index="57" name="UART2_TX" />
         <interrupt caption="UART 2 Error" index="58" name="UART2_ERR" />
         <interrupt caption="UART 3 Reception" index="59" name="UART3_RX" />
         <interrupt caption="UART 3 Transmission" index="60" name="UART3_TX" />
         <interrupt caption="UART 3 Error" index="61" name="UART3_ERR" />
         <interrupt caption="I2C 1 Slave" index="65" name="I2C1_SLAVE" />
         <interrupt caption="I2C 1 Master" index="66" name="I2C1_MASTER" />
         <interrupt caption="I2C 1 Bus Collision" index="67" name="I2C1_BUS" />
         <interrupt caption="I2C 2 Slave" index="68" name="I2C2_SLAVE" />
         <interrupt caption="I2C 2 Master" index="69" name="I2C2_MASTER" />
         <interrupt caption="I2C 2 Bus Collision" index="70" name="I2C2_BUS" />
         <interrupt caption="I2C 3 Slave" index="71" name="I2C3_SLAVE" />
         <interrupt caption="I2C 3 Master" index="72" name="I2C3_MASTER" />
         <interrupt caption="I2C 3 Bus Collision" index="73" name="I2C3_BUS" />
         <interrupt caption="CCP 1 Input Capture or Output Compare" index="74" name="CCP1" />
         <interrupt caption="CCP 1 Timer" index="75" name="CCT1" />
         <interrupt caption="CCP 2 Input Capture or Output Compare" index="76" name="CCP2" />
         <interrupt caption="CCP 2 Timer" index="77" name="CCT2" />
         <interrupt caption="CCP 3 Input Capture or Output Compare" index="78" name="CCP3" />
         <interrupt caption="CCP 3 Timer" index="79" name="CCT3" />
         <interrupt caption="CCP 4 Input Capture or Output Compare" index="80" name="CCP4" />
         <interrupt caption="CCP 4 Timer" index="81" name="CCT4" />
         <interrupt caption="CCP 5 Input Capture or Output Compare" index="82" name="CCP5" />
         <interrupt caption="CCP 5 Timer" index="83" name="CCT5" />
         <interrupt caption="CCP 6 Input Capture or Output Compare" index="84" name="CCP6" />
         <interrupt caption="CCP 6 Timer" index="85" name="CCT6" />
         <interrupt caption="CCP 7 Input Capture or Output Compare" index="86" name="CCP7" />
         <interrupt caption="CCP 7 Timer" index="87" name="CCT7" />
         <interrupt caption="CCP 8 Input Capture or Output Compare" index="88" name="CCP8" />
         <interrupt caption="CCP 8 Timer" index="89" name="CCT8" />
         <interrupt caption="CCP 9 Input Capture or Output Compare" index="90" name="CCP9" />
         <interrupt caption="CCP 9 Timer" index="91" name="CCT9" />
         <interrupt caption="FRC Tune" index="92" name="FRC_TUNE" />
         <interrupt caption="NVM Program or Erase Complete" index="94" name="NVM" />
         <interrupt caption="Core Performance Counter" index="95" name="PERFORMANCE_COUNTER" />
         <interrupt caption="ECC Single Bit error" index="97" name="ECCSB_ERR" />
         <interrupt caption="DMA channel 0" index="98" name="DMA0" />
         <interrupt caption="DMA channel 1" index="99" name="DMA1" />
         <interrupt caption="DMA channel 2" index="100" name="DMA2" />
         <interrupt caption="DMA channel 3" index="101" name="DMA3" />
      </interrupts>
      <interfaces>
         <interface name="JTAG" type="samjtag" />
         <interface name="SWD" type="swd" />
      </interfaces>
   </device>
</devices>
<modules>
   <module caption="" id="02805" name="ADC" version="">
      <register-group name="ADC">
         <register caption="" name="ADC1BUF0" offset="0x0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF0" />
         </register>
