Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM048.atdf
         <register caption="" name="CCP2CON1" offset="0x100" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="MOD" />
            <bitfield caption="" mask="0x00000010" name="CCSEL" />
            <bitfield caption="" mask="0x00000020" name="T32" />
            <bitfield caption="" mask="0x000000C0" name="TMRPS" values="CCP2CON1__TMRPS" />
            <bitfield caption="" mask="0x00000700" name="CLKSEL" values="CCP2CON1__CLKSEL" />
            <bitfield caption="" mask="0x00000800" name="TMRSYNC" />
            <bitfield caption="" mask="0x00001000" name="CCPSLP" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="SYNC" values="CCP2CON1__SYNC" />
            <bitfield caption="" mask="0x00200000" name="ALTSYNC" />
            <bitfield caption="" mask="0x00400000" name="ONESHOT" />
            <bitfield caption="" mask="0x00800000" name="TRIGEN" />
            <bitfield caption="" mask="0x0F000000" name="OPS" values="CCP2CON1__OPS" />
            <bitfield caption="" mask="0x40000000" name="RTRGEN" />
            <bitfield caption="" mask="0x80000000" name="OPSSRC" />
         </register>
         <register caption="" name="CCP3CON1" offset="0x200" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="MOD" />
            <bitfield caption="" mask="0x00000010" name="CCSEL" />
            <bitfield caption="" mask="0x00000020" name="T32" />
            <bitfield caption="" mask="0x000000C0" name="TMRPS" values="CCP3CON1__TMRPS" />
            <bitfield caption="" mask="0x00000700" name="CLKSEL" values="CCP3CON1__CLKSEL" />
            <bitfield caption="" mask="0x00000800" name="TMRSYNC" />
            <bitfield caption="" mask="0x00001000" name="CCPSLP" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="SYNC" values="CCP3CON1__SYNC" />
            <bitfield caption="" mask="0x00200000" name="ALTSYNC" />
            <bitfield caption="" mask="0x00400000" name="ONESHOT" />
            <bitfield caption="" mask="0x00800000" name="TRIGEN" />
            <bitfield caption="" mask="0x0F000000" name="OPS" values="CCP3CON1__OPS" />
            <bitfield caption="" mask="0x40000000" name="RTRGEN" />
            <bitfield caption="" mask="0x80000000" name="OPSSRC" />
         </register>
         <register caption="" name="CCP4CON1" offset="0x300" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="MOD" />
            <bitfield caption="" mask="0x00000010" name="CCSEL" />
            <bitfield caption="" mask="0x00000020" name="T32" />
            <bitfield caption="" mask="0x000000C0" name="TMRPS" values="CCP4CON1__TMRPS" />
            <bitfield caption="" mask="0x00000700" name="CLKSEL" values="CCP4CON1__CLKSEL" />
            <bitfield caption="" mask="0x00000800" name="TMRSYNC" />
            <bitfield caption="" mask="0x00001000" name="CCPSLP" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="SYNC" values="CCP4CON1__SYNC" />
            <bitfield caption="" mask="0x00200000" name="ALTSYNC" />
            <bitfield caption="" mask="0x00400000" name="ONESHOT" />
            <bitfield caption="" mask="0x00800000" name="TRIGEN" />
            <bitfield caption="" mask="0x0F000000" name="OPS" values="CCP4CON1__OPS" />
            <bitfield caption="" mask="0x40000000" name="RTRGEN" />
            <bitfield caption="" mask="0x80000000" name="OPSSRC" />
         </register>
         <register caption="" name="CCP5CON1" offset="0x400" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="MOD" />
            <bitfield caption="" mask="0x00000010" name="CCSEL" />
            <bitfield caption="" mask="0x00000020" name="T32" />
            <bitfield caption="" mask="0x000000C0" name="TMRPS" values="CCP5CON1__TMRPS" />
            <bitfield caption="" mask="0x00000700" name="CLKSEL" values="CCP5CON1__CLKSEL" />
            <bitfield caption="" mask="0x00000800" name="TMRSYNC" />
            <bitfield caption="" mask="0x00001000" name="CCPSLP" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="SYNC" values="CCP5CON1__SYNC" />
            <bitfield caption="" mask="0x00200000" name="ALTSYNC" />
            <bitfield caption="" mask="0x00400000" name="ONESHOT" />
            <bitfield caption="" mask="0x00800000" name="TRIGEN" />
            <bitfield caption="" mask="0x0F000000" name="OPS" values="CCP5CON1__OPS" />
            <bitfield caption="" mask="0x40000000" name="RTRGEN" />
            <bitfield caption="" mask="0x80000000" name="OPSSRC" />
         </register>
         <register caption="" name="CCP6CON1" offset="0x500" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="MOD" />
            <bitfield caption="" mask="0x00000010" name="CCSEL" />
            <bitfield caption="" mask="0x00000020" name="T32" />
            <bitfield caption="" mask="0x000000C0" name="TMRPS" values="CCP6CON1__TMRPS" />
            <bitfield caption="" mask="0x00000700" name="CLKSEL" values="CCP6CON1__CLKSEL" />
            <bitfield caption="" mask="0x00000800" name="TMRSYNC" />
            <bitfield caption="" mask="0x00001000" name="CCPSLP" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="SYNC" values="CCP6CON1__SYNC" />
            <bitfield caption="" mask="0x00200000" name="ALTSYNC" />
            <bitfield caption="" mask="0x00400000" name="ONESHOT" />
            <bitfield caption="" mask="0x00800000" name="TRIGEN" />
            <bitfield caption="" mask="0x0F000000" name="OPS" values="CCP6CON1__OPS" />
            <bitfield caption="" mask="0x40000000" name="RTRGEN" />
            <bitfield caption="" mask="0x80000000" name="OPSSRC" />
         </register>
