Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM048.atdf
      <value-group caption="Comparator Output Enable bit" name="CM2CON__COE">
         <value caption="Comparator output is driven on the output CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is not driven on the output CxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator ON bit" name="CM2CON__ON">
         <value caption="Module is enabled. Setting this bit does not affect the other bits in this register" name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in this register" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Negative Input Configuration" name="CM3CON__CCH">
         <value caption="Comparator inverting input is connected to the band gap reference voltage" name="" value="0x3" />
         <value caption="Comparator inverting input is connected to the CxIND pin" name="" value="0x2" />
         <value caption="Comparator inverting input is connected to the CxINC pin" name="" value="0x1" />
         <value caption="Comparator inverting input is connected to the CxINB pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Positive Input Configuration" name="CM3CON__CREF">
         <value caption="Comparator Non-inverting input connects to the reference defined by the CVREFSEL bit" name="" value="0x1" />
         <value caption="Comparator non-inverting input is connected to the CxINA pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Event Polarity Select bits" name="CM3CON__EVPOL">
         <value caption="Comparator event is generated on any change of the comparator output" name="" value="0x3" />
         <value caption="Comparator event is generated on a high-to-low transition (if CPOL = 0) or low-to-high transition (if CPOL = 1) of the comparator output" name="" value="0x2" />
         <value caption="Comparator event is generated on a high-to-low transition (if CPOL = 1) or low-to-high transition (if CPOL = 0) of the comparator output" name="" value="0x1" />
         <value caption="Comparator event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM3CON__COUT">
         <value caption="VIN+ is greater than VIN- (if CPOL = 0)/VIN+ is smaller than VIN- (if CPOL = 1)" name="" value="0x1" />
         <value caption="VIN+ is greater than VIN- (if CPOL = 1)/VIN+ is smaller than VIN- (if CPOL = 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Inversion bit" name="CM3CON__CPOL">
         <value caption="Output is inverted" name="" value="0x1" />
         <value caption="Output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM3CON__COE">
         <value caption="Comparator output is driven on the output CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is not driven on the output CxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator ON bit" name="CM3CON__ON">
         <value caption="Module is enabled. Setting this bit does not affect the other bits in this register" name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in this register" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00000" name="CORE" version="">
      <register-group name="CORE" />
   </module>
   <module caption="" id="02823" name="CRU" version="">
      <register-group name="CRU">
         <register caption="Reference Oscillator Control Register" name="REFO1CON" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO1CON__ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO1CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO1CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO1CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO1CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO1CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO1CON__ON" />
            <bitfield caption="" mask="0x7FFF0000" name="RODIV" values="REFO1CON__RODIV" />
         </register>
         <register caption="Reference Oscillator Trim Register" name="REFO1TRIM" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Reference Oscillator Trim bits" mask="0xFF800000" name="ROTRIM" values="REFO1TRIM__ROTRIM" />
         </register>
         <register caption="Oscillator Clock Status Register" name="CLKSTAT" offset="0xf0" rw="RW" size="4">
            <bitfield caption="Fast RC (FRC) Oscillator Ready Status bit" mask="0x00000001" name="FRCRDY" values="CLKSTAT__FRCRDY" />
            <bitfield caption="System PLL Ready Status bit" mask="0x00000002" name="SPDIVRDY" values="CLKSTAT__SPDIVRDY" />
            <bitfield caption="Primary Oscillator (POSC) Ready Status bit" mask="0x00000004" name="POSCRDY" values="CLKSTAT__POSCRDY" />
            <bitfield caption="Secondary Oscillator (SOSC) Ready Status bit" mask="0x00000010" name="SOSCRDY" values="CLKSTAT__SOSCRDY" />
            <bitfield caption="Low-Power RC (LPRC) Oscillator Ready Status bit" mask="0x00000020" name="LPRCRDY" values="CLKSTAT__LPRCRDY" />
            <bitfield caption="System PLL (SPLL) Ready Status bit" mask="0x00000080" name="SPLLRDY" values="CLKSTAT__SPLLRDY" />
         </register>
         <register caption="FRC Tuning Register" name="OSCTUN" offset="0x200" rw="RW" size="4">
            <bitfield caption="FRC Oscillator Tuning bits" mask="0x0000003F" name="TUN" values="OSCTUN__TUN" />
            <bitfield caption="" mask="0x00000100" name="ORPOL" />
            <bitfield caption="" mask="0x00000200" name="OR" />
            <bitfield caption="" mask="0x00000400" name="POL" />
            <bitfield caption="" mask="0x00000800" name="LOCK" />
            <bitfield caption="" mask="0x00001000" name="SRC" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
         <register caption="Oscillator Control Register" name="OSCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Oscillator Switch Enable bit" mask="0x00000001" name="OSWEN" values="OSCCON__OSWEN" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x00000002" name="SOSCEN" values="OSCCON__SOSCEN" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00000008" name="CF" values="OSCCON__CF" />
            <bitfield caption="Sleep Mode Enable bit" mask="0x00000010" name="SLPEN" values="OSCCON__SLPEN" />
            <bitfield caption="Clock Selection Lock Enable bit" mask="0x00000080" name="CLKLOCK" values="OSCCON__CLKLOCK" />
            <bitfield caption="New Oscillator Selection bits" mask="0x00000700" name="NOSC" values="OSCCON__NOSC" />
            <bitfield caption="Current Oscillator Selection bits" mask="0x00007000" name="COSC" values="OSCCON__COSC" />
            <bitfield caption="Internal Fast RC Oscillator Clock Divider bits" mask="0x07000000" name="FRCDIV" values="OSCCON__FRCDIV" />
         </register>
         <register caption="System PLL Control Register" name="SPLLCON" offset="0x20" rw="RW" size="4">
            <bitfield caption="System PLL Input Clock Source bit" mask="0x00000080" name="PLLICLK" values="SPLLCON__PLLICLK" />
            <bitfield caption="System PLL Multiplier bits" mask="0x007F0000" name="PLLMULT" values="SPLLCON__PLLMULT" />
            <bitfield caption="System PLL Output Clock Divider bits" mask="0x07000000" name="PLLODIV" values="SPLLCON__PLLODIV" />
         </register>
      </register-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO1CON__ROSEL">
         <value caption="Reserved" name="Reserved" value="0xf" />
         <value caption="Reserved" name="Reserved" value="0xe" />
         <value caption="Reserved" name="Reserved" value="0xd" />
         <value caption="Reserved" name="Reserved" value="0xc" />
         <value caption="Reserved" name="Reserved" value="0xb" />
         <value caption="Reserved" name="Reserved" value="0xa" />
         <value caption="REFCLKI" name="REFCLKI" value="0x9" />
         <value caption="System PLL VCO output" name="Fvco" value="0x7" />
         <value caption="SOSC" name="SOSC" value="0x5" />
         <value caption="LPRC" name="LPRC" value="0x4" />
         <value caption="FRC" name="FRC" value="0x3" />
         <value caption="POSC" name="POSC" value="0x2" />
         <value caption="SYSCLK" name="SYSCLK" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO1CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO1CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO1CON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
