Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM048.atdf
         <register caption="" name="CNEN0B" offset="0x420" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE0B0" />
            <bitfield caption="" mask="0x00000002" name="CNIE0B1" />
            <bitfield caption="" mask="0x00000004" name="CNIE0B2" />
            <bitfield caption="" mask="0x00000008" name="CNIE0B3" />
            <bitfield caption="" mask="0x00000010" name="CNIE0B4" />
            <bitfield caption="" mask="0x00000020" name="CNIE0B5" />
            <bitfield caption="" mask="0x00000040" name="CNIE0B6" />
            <bitfield caption="" mask="0x00000080" name="CNIE0B7" />
            <bitfield caption="" mask="0x00000100" name="CNIE0B8" />
            <bitfield caption="" mask="0x00000200" name="CNIE0B9" />
            <bitfield caption="" mask="0x00000400" name="CNIE0B10" />
            <bitfield caption="" mask="0x00000800" name="CNIE0B11" />
            <bitfield caption="" mask="0x00002000" name="CNIE0B13" />
            <bitfield caption="" mask="0x00004000" name="CNIE0B14" />
            <bitfield caption="" mask="0x00008000" name="CNIE0B15" />
         </register>
         <register caption="" name="CNSTATB" offset="0x430" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATB0" />
            <bitfield caption="" mask="0x00000002" name="CNSTATB1" />
            <bitfield caption="" mask="0x00000004" name="CNSTATB2" />
            <bitfield caption="" mask="0x00000008" name="CNSTATB3" />
            <bitfield caption="" mask="0x00000010" name="CNSTATB4" />
            <bitfield caption="" mask="0x00000020" name="CNSTATB5" />
            <bitfield caption="" mask="0x00000040" name="CNSTATB6" />
            <bitfield caption="" mask="0x00000080" name="CNSTATB7" />
            <bitfield caption="" mask="0x00000100" name="CNSTATB8" />
            <bitfield caption="" mask="0x00000200" name="CNSTATB9" />
            <bitfield caption="" mask="0x00000400" name="CNSTATB10" />
            <bitfield caption="" mask="0x00000800" name="CNSTATB11" />
            <bitfield caption="" mask="0x00002000" name="CNSTATB13" />
            <bitfield caption="" mask="0x00004000" name="CNSTATB14" />
            <bitfield caption="" mask="0x00008000" name="CNSTATB15" />
         </register>
         <register caption="" name="CNEN1B" offset="0x440" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE1B0" />
            <bitfield caption="" mask="0x00000002" name="CNIE1B1" />
            <bitfield caption="" mask="0x00000004" name="CNIE1B2" />
            <bitfield caption="" mask="0x00000008" name="CNIE1B3" />
            <bitfield caption="" mask="0x00000010" name="CNIE1B4" />
            <bitfield caption="" mask="0x00000020" name="CNIE1B5" />
            <bitfield caption="" mask="0x00000040" name="CNIE1B6" />
            <bitfield caption="" mask="0x00000080" name="CNIE1B7" />
            <bitfield caption="" mask="0x00000100" name="CNIE1B8" />
            <bitfield caption="" mask="0x00000200" name="CNIE1B9" />
            <bitfield caption="" mask="0x00000400" name="CNIE1B10" />
            <bitfield caption="" mask="0x00000800" name="CNIE1B11" />
            <bitfield caption="" mask="0x00002000" name="CNIE1B13" />
            <bitfield caption="" mask="0x00004000" name="CNIE1B14" />
            <bitfield caption="" mask="0x00008000" name="CNIE1B15" />
         </register>
         <register caption="" name="CNFB" offset="0x450" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFB0" />
            <bitfield caption="" mask="0x00000002" name="CNFB1" />
            <bitfield caption="" mask="0x00000004" name="CNFB2" />
            <bitfield caption="" mask="0x00000008" name="CNFB3" />
            <bitfield caption="" mask="0x00000010" name="CNFB4" />
            <bitfield caption="" mask="0x00000020" name="CNFB5" />
            <bitfield caption="" mask="0x00000040" name="CNFB6" />
            <bitfield caption="" mask="0x00000080" name="CNFB7" />
            <bitfield caption="" mask="0x00000100" name="CNFB8" />
            <bitfield caption="" mask="0x00000200" name="CNFB9" />
            <bitfield caption="" mask="0x00000400" name="CNFB10" />
            <bitfield caption="" mask="0x00000800" name="CNFB11" />
            <bitfield caption="" mask="0x00002000" name="CNFB13" />
            <bitfield caption="" mask="0x00004000" name="CNFB14" />
            <bitfield caption="" mask="0x00008000" name="CNFB15" />
         </register>
         <register caption="" name="SR0B" offset="0x460" rw="RW" size="4" />
         <register caption="" name="SR1B" offset="0x470" rw="RW" size="4" />
         <register caption="" name="ANSELC" offset="0x4a0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ANSC0" />
            <bitfield caption="" mask="0x00000002" name="ANSC1" />
            <bitfield caption="" mask="0x00000020" name="ANSC5" />
            <bitfield caption="" mask="0x00000100" name="ANSC8" />
         </register>
         <register caption="" name="TRISC" offset="0x4b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="TRISC0" />
            <bitfield caption="" mask="0x00000002" name="TRISC1" />
            <bitfield caption="" mask="0x00000004" name="TRISC2" />
            <bitfield caption="" mask="0x00000008" name="TRISC3" />
            <bitfield caption="" mask="0x00000010" name="TRISC4" />
            <bitfield caption="" mask="0x00000020" name="TRISC5" />
            <bitfield caption="" mask="0x00000040" name="TRISC6" />
            <bitfield caption="" mask="0x00000080" name="TRISC7" />
            <bitfield caption="" mask="0x00000100" name="TRISC8" />
            <bitfield caption="" mask="0x00000200" name="TRISC9" />
            <bitfield caption="" mask="0x00001000" name="TRISC12" />
         </register>
         <register caption="" name="PORTC" offset="0x4c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="RC0" />
            <bitfield caption="" mask="0x00000002" name="RC1" />
            <bitfield caption="" mask="0x00000004" name="RC2" />
            <bitfield caption="" mask="0x00000008" name="RC3" />
            <bitfield caption="" mask="0x00000010" name="RC4" />
            <bitfield caption="" mask="0x00000020" name="RC5" />
            <bitfield caption="" mask="0x00000040" name="RC6" />
            <bitfield caption="" mask="0x00000080" name="RC7" />
            <bitfield caption="" mask="0x00000100" name="RC8" />
            <bitfield caption="" mask="0x00000200" name="RC9" />
            <bitfield caption="" mask="0x00001000" name="RC12" />
         </register>
         <register caption="" name="LATC" offset="0x4d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="LATC0" />
            <bitfield caption="" mask="0x00000002" name="LATC1" />
            <bitfield caption="" mask="0x00000004" name="LATC2" />
            <bitfield caption="" mask="0x00000008" name="LATC3" />
            <bitfield caption="" mask="0x00000010" name="LATC4" />
            <bitfield caption="" mask="0x00000020" name="LATC5" />
            <bitfield caption="" mask="0x00000040" name="LATC6" />
            <bitfield caption="" mask="0x00000080" name="LATC7" />
            <bitfield caption="" mask="0x00000100" name="LATC8" />
            <bitfield caption="" mask="0x00000200" name="LATC9" />
            <bitfield caption="" mask="0x00001000" name="LATC12" />
         </register>
         <register caption="" name="ODCC" offset="0x4e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ODCC0" />
            <bitfield caption="" mask="0x00000002" name="ODCC1" />
            <bitfield caption="" mask="0x00000004" name="ODCC2" />
            <bitfield caption="" mask="0x00000008" name="ODCC3" />
            <bitfield caption="" mask="0x00000010" name="ODCC4" />
            <bitfield caption="" mask="0x00000020" name="ODCC5" />
            <bitfield caption="" mask="0x00000040" name="ODCC6" />
            <bitfield caption="" mask="0x00000080" name="ODCC7" />
            <bitfield caption="" mask="0x00000100" name="ODCC8" />
            <bitfield caption="" mask="0x00000200" name="ODCC9" />
            <bitfield caption="" mask="0x00001000" name="ODCC12" />
         </register>
         <register caption="" name="CNPUC" offset="0x4f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUC0" />
            <bitfield caption="" mask="0x00000002" name="CNPUC1" />
            <bitfield caption="" mask="0x00000004" name="CNPUC2" />
            <bitfield caption="" mask="0x00000008" name="CNPUC3" />
            <bitfield caption="" mask="0x00000010" name="CNPUC4" />
            <bitfield caption="" mask="0x00000020" name="CNPUC5" />
            <bitfield caption="" mask="0x00000040" name="CNPUC6" />
            <bitfield caption="" mask="0x00000080" name="CNPUC7" />
            <bitfield caption="" mask="0x00000100" name="CNPUC8" />
            <bitfield caption="" mask="0x00000200" name="CNPUC9" />
            <bitfield caption="" mask="0x00001000" name="CNPUC12" />
         </register>
         <register caption="" name="CNPDC" offset="0x500" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDC0" />
            <bitfield caption="" mask="0x00000002" name="CNPDC1" />
            <bitfield caption="" mask="0x00000004" name="CNPDC2" />
            <bitfield caption="" mask="0x00000008" name="CNPDC3" />
            <bitfield caption="" mask="0x00000010" name="CNPDC4" />
            <bitfield caption="" mask="0x00000020" name="CNPDC5" />
            <bitfield caption="" mask="0x00000040" name="CNPDC6" />
            <bitfield caption="" mask="0x00000080" name="CNPDC7" />
            <bitfield caption="" mask="0x00000100" name="CNPDC8" />
            <bitfield caption="" mask="0x00000200" name="CNPDC9" />
            <bitfield caption="" mask="0x00001000" name="CNPDC12" />
         </register>
         <register caption="" name="CNCONC" offset="0x510" rw="RW" size="4">
            <bitfield caption="" mask="0x00000400" name="PORT32" />
            <bitfield caption="" mask="0x00000800" name="CNSTYLE" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
