Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM048.atdf
         <register caption="" name="IPC0" offset="0x81d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CTIS" />
            <bitfield caption="" mask="0x0000001C" name="CTIP" />
            <bitfield caption="" mask="0x00000300" name="CS0IS" />
            <bitfield caption="" mask="0x00001C00" name="CS0IP" />
            <bitfield caption="" mask="0x00030000" name="CS1IS" />
            <bitfield caption="" mask="0x001C0000" name="CS1IP" />
            <bitfield caption="" mask="0x03000000" name="INT0IS" />
            <bitfield caption="" mask="0x1C000000" name="INT0IP" />
         </register>
         <register caption="" name="IPC1" offset="0x81e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="INT1IS" />
            <bitfield caption="" mask="0x0000001C" name="INT1IP" />
            <bitfield caption="" mask="0x00000300" name="INT2IS" />
            <bitfield caption="" mask="0x00001C00" name="INT2IP" />
            <bitfield caption="" mask="0x00030000" name="INT3IS" />
            <bitfield caption="" mask="0x001C0000" name="INT3IP" />
            <bitfield caption="" mask="0x03000000" name="INT4IS" />
            <bitfield caption="" mask="0x1C000000" name="INT4IP" />
         </register>
         <register caption="" name="IPC2" offset="0x81f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CNAIS" />
            <bitfield caption="" mask="0x0000001C" name="CNAIP" />
            <bitfield caption="" mask="0x00000300" name="CNBIS" />
            <bitfield caption="" mask="0x00001C00" name="CNBIP" />
            <bitfield caption="" mask="0x00030000" name="CNCIS" />
            <bitfield caption="" mask="0x001C0000" name="CNCIP" />
            <bitfield caption="" mask="0x03000000" name="CNDIS" />
            <bitfield caption="" mask="0x1C000000" name="CNDIP" />
         </register>
         <register caption="" name="IPC3" offset="0x8200" rw="R" size="4" />
         <register caption="" name="IPC4" offset="0x8210" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="T1IS" />
            <bitfield caption="" mask="0x00001C00" name="T1IP" />
            <bitfield caption="" mask="0x00030000" name="T2IS" />
            <bitfield caption="" mask="0x001C0000" name="T2IP" />
            <bitfield caption="" mask="0x03000000" name="T3IS" />
            <bitfield caption="" mask="0x1C000000" name="T3IP" />
         </register>
         <register caption="" name="IPC5" offset="0x8220" rw="RW" size="4">
            <bitfield caption="" mask="0x03000000" name="CMP1IS" />
            <bitfield caption="" mask="0x1C000000" name="CMP1IP" />
         </register>
         <register caption="" name="IPC6" offset="0x8230" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CMP2IS" />
            <bitfield caption="" mask="0x0000001C" name="CMP2IP" />
            <bitfield caption="" mask="0x00000300" name="CMP3IS" />
            <bitfield caption="" mask="0x00001C00" name="CMP3IP" />
         </register>
         <register caption="" name="IPC7" offset="0x8240" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="USBIS" />
            <bitfield caption="" mask="0x00001C00" name="USBIP" />
         </register>
         <register caption="" name="IPC8" offset="0x8250" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="RTCCIS" />
            <bitfield caption="" mask="0x0000001C" name="RTCCIP" />
            <bitfield caption="" mask="0x00000300" name="AD1IS" />
            <bitfield caption="" mask="0x00001C00" name="AD1IP" />
         </register>
         <register caption="" name="IPC9" offset="0x8260" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="LVDIS" />
            <bitfield caption="" mask="0x0000001C" name="LVDIP" />
            <bitfield caption="" mask="0x00000300" name="CLC1IS" />
            <bitfield caption="" mask="0x00001C00" name="CLC1IP" />
            <bitfield caption="" mask="0x00030000" name="CLC2IS" />
            <bitfield caption="" mask="0x001C0000" name="CLC2IP" />
            <bitfield caption="" mask="0x03000000" name="CLC3IS" />
            <bitfield caption="" mask="0x1C000000" name="CLC3IP" />
         </register>
         <register caption="" name="IPC10" offset="0x8270" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CLC4IS" />
            <bitfield caption="" mask="0x0000001C" name="CLC4IP" />
            <bitfield caption="" mask="0x00000300" name="SPI1EIS" />
            <bitfield caption="" mask="0x00001C00" name="SPI1EIP" />
            <bitfield caption="" mask="0x00030000" name="SPI1TXIS" />
            <bitfield caption="" mask="0x001C0000" name="SPI1TXIP" />
            <bitfield caption="" mask="0x03000000" name="SPI1RXIS" />
            <bitfield caption="" mask="0x1C000000" name="SPI1RXIP" />
         </register>
         <register caption="" name="IPC11" offset="0x8280" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="SPI2EIS" />
            <bitfield caption="" mask="0x0000001C" name="SPI2EIP" />
            <bitfield caption="" mask="0x00000300" name="SPI2TXIS" />
            <bitfield caption="" mask="0x00001C00" name="SPI2TXIP" />
            <bitfield caption="" mask="0x00030000" name="SPI2RXIS" />
            <bitfield caption="" mask="0x001C0000" name="SPI2RXIP" />
            <bitfield caption="" mask="0x03000000" name="SPI3EIS" />
            <bitfield caption="" mask="0x1C000000" name="SPI3EIP" />
         </register>
         <register caption="" name="IPC12" offset="0x8290" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="SPI3TXIS" />
            <bitfield caption="" mask="0x0000001C" name="SPI3TXIP" />
            <bitfield caption="" mask="0x00000300" name="SPI3RXIS" />
            <bitfield caption="" mask="0x00001C00" name="SPI3RXIP" />
         </register>
         <register caption="" name="IPC13" offset="0x82a0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="U1RXIS" />
            <bitfield caption="" mask="0x00001C00" name="U1RXIP" />
            <bitfield caption="" mask="0x00030000" name="U1TXIS" />
            <bitfield caption="" mask="0x001C0000" name="U1TXIP" />
            <bitfield caption="" mask="0x03000000" name="U1EIS" />
            <bitfield caption="" mask="0x1C000000" name="U1EIP" />
         </register>
         <register caption="" name="IPC14" offset="0x82b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="U2RXIS" />
            <bitfield caption="" mask="0x0000001C" name="U2RXIP" />
            <bitfield caption="" mask="0x00000300" name="U2TXIS" />
            <bitfield caption="" mask="0x00001C00" name="U2TXIP" />
            <bitfield caption="" mask="0x00030000" name="U2EIS" />
            <bitfield caption="" mask="0x001C0000" name="U2EIP" />
            <bitfield caption="" mask="0x03000000" name="U3RXIS" />
            <bitfield caption="" mask="0x1C000000" name="U3RXIP" />
         </register>
         <register caption="" name="IPC15" offset="0x82c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="U3TXIS" />
            <bitfield caption="" mask="0x0000001C" name="U3TXIP" />
            <bitfield caption="" mask="0x00000300" name="U3EIS" />
            <bitfield caption="" mask="0x00001C00" name="U3EIP" />
         </register>
